taylorCouetteGym/experiments/modulation_rl/results/warmed_eval/duty_v1_s1/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volVectorField;
    location        "60";
    object          U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
3330
(
(0.00371687 0.284169 0.00186799)
(-0.0159196 0.0731513 -0.00134078)
(-0.0149319 0.0317271 0.00141119)
(-0.0232403 0.0280441 0.00183458)
(-0.0307935 0.0312728 0.00235285)
(-0.0367788 0.0348493 0.00252253)
(-0.0407599 0.0374125 0.00268964)
(-0.0430401 0.0386618 0.00321014)
...
)
;

boundaryField
{
    inner_wall
    {
        type            rotatingWallVelocity;
        origin          ( 0 0 0 );
        axis            ( 0 0 1 );
        omega           table ( ( 0 31.4159 ) ( 11 31.4159 ) );
        value           nonuniform List<vector> 90{(0 0.797204 0)};
    }
    outer_wall
    {
        type            noSlip;
    }
    side_outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            codedFixedValue;
        value           nonuniform List<vector> 
37
(
(0 0 -0.00034074)
(0 0 -0.000958598)
(0 0 -0.00141268)
(0 0 -0.00173603)
(0 0 -0.00195542)
(0 0 -0.00209255)
(0 0 -0.00216502)
(0 0 -0.00218706)
...
)
;
        name            lopezFullyDevelopedAnnularTopInlet;
        code            #{
            const fvPatch& p = patch();
            vectorField Uin(p.size(), vector::zero);

            const vectorField& Cf = p.Cf();
            const vectorField& Sf = p.Sf();

            const scalar Ri = 0.0254;
            const scalar Ro = 0.03175;
            const scalar Q0 = 100e-6/60.0;  // full 360-degree flow rate [m3/s]
            // UNIFIED to 100 mL/min to match side_outlet_cat_wallmodel (was Yuhe's
            // 40 mL/min). This makes the outer-wall catalytic BC the ONLY difference
            // between the two cases (single controlled variable), and shrinks the
            // residence time (tau ~ 26 s) so the episode reaches steady state well.
            const scalar pi = 3.1415926535897932384626433832795;

            const scalar Aann = pi*(sqr(Ro) - sqr(Ri));
            const scalar Umean = Q0/Aann;

            scalarField shape(p.size(), scalar(0));
            scalar sumShapeA = scalar(0);
            scalar sumA = scalar(0);

            forAll(Cf, faceI)
            {
                const scalar r = sqrt(sqr(Cf[faceI].x()) + sqr(Cf[faceI].y()));

                scalar f =
                    sqr(Ro) - sqr(r)
                  - (sqr(Ro) - sqr(Ri))/log(Ro/Ri)*log(Ro/r);

                shape[faceI] = max(f, scalar(0));

                const scalar Af = mag(Sf[faceI]);
                sumShapeA += shape[faceI]*Af;
                sumA      += Af;
            }

            reduce(sumShapeA, sumOp<scalar>());
            reduce(sumA, sumOp<scalar>());

            const scalar meanShape = sumShapeA/max(sumA, VSMALL);
            const scalar scale = Umean/max(meanShape, VSMALL);

            forAll(Cf, faceI)
            {
                const vector nHat = Sf[faceI]/mag(Sf[faceI]);
                // Top inlet outward normal points +z; inflow is opposite to it.
                Uin[faceI] = -scale*shape[faceI]*nHat;
            }

            operator==(Uin);
        #};
    }
    bottom
    {
        type            noSlip;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
