taylorCouetteGym/experiments/modulation_rl/results/warmed_eval/duty_v1_s1/case/0/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "60";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   nonuniform List<scalar> 
3330
(
34.0723367
34.0705187
34.0660809
34.066507
34.0670971
34.0666744
34.0711057
34.0733841
...
)
;

boundaryField
{
    inner_wall
    {
        type            zeroGradient;
    }
    outer_wall
    {
        type            fixedValue;
        value           uniform 0;
    }
    side_outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 50;
    }
    bottom
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
