taylorCouetteGym/experiments/modulation_rl/results/warmed_eval/duty_v1_s1/case/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "60";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
6533
(
-9.25252719e-09
9.25253131e-09
-1.25352386e-08
3.28271598e-09
-1.94617041e-08
6.92647104e-09
-2.73113953e-08
7.84969227e-09
...
)
;

boundaryField
{
    inner_wall
    {
        type            calculated;
        value           uniform 0;
    }
    outer_wall
    {
        type            calculated;
        value           uniform 0;
    }
    side_outlet
    {
        type            calculated;
        value           uniform 2.31147039e-08;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
37
(
-4.14356661e-10
-1.09186884e-09
-1.50415567e-09
-1.72486519e-09
-1.81011054e-09
-1.80218693e-09
-1.73260372e-09
-1.62452735e-09
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            wedge;
        value           nonuniform List<scalar> 
3330
(
-6.53820253e-08
-1.54510349e-08
-6.15204532e-09
-4.99212583e-09
-5.11050488e-09
-5.2281203e-09
-5.15255314e-09
-4.88812032e-09
...
)
;
    }
    back
    {
        type            wedge;
        value           nonuniform List<scalar> 
3330
(
6.53820253e-08
1.54510349e-08
6.15204532e-09
4.99212583e-09
5.11050488e-09
5.22812028e-09
5.15255317e-09
4.8881203e-09
...
)
;
    }
}


// ************************************************************************* //
