taylorCouetteGym/experiments/modulation_rl/results/warmed_eval/duty_v1_s1/case/0/phi_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "60";
    object      phi_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
6533
(
-9.2483793e-09
9.2483827e-09
-1.25341067e-08
3.28573115e-09
-1.94734699e-08
6.93936779e-09
-2.73335284e-08
7.86005934e-09
...
)
;

boundaryField
{
    inner_wall
    {
        type            calculated;
        value           uniform 0;
    }
    outer_wall
    {
        type            calculated;
        value           uniform 0;
    }
    side_outlet
    {
        type            calculated;
        value           uniform 2.31154185e-08;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
37
(
-4.14356661e-10
-1.09186884e-09
-1.50415567e-09
-1.72486519e-09
-1.81011054e-09
-1.80218693e-09
-1.73260372e-09
-1.62452735e-09
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            wedge;
        value           nonuniform List<scalar> 
3330
(
-6.53781691e-08
-1.54492413e-08
-6.15133636e-09
-4.99177686e-09
-5.11002092e-09
-5.2272924e-09
-5.15185134e-09
-4.8876531e-09
...
)
;
    }
    back
    {
        type            wedge;
        value           nonuniform List<scalar> 
3330
(
6.53781692e-08
1.54492413e-08
6.15133636e-09
4.99177686e-09
5.11002092e-09
5.22729238e-09
5.15185137e-09
4.88765307e-09
...
)
;
    }
}


// ************************************************************************* //
